// Задача №1. Только что
fun main(args: Array<String>) {
    println("Введите время в секундах, когда пользователь покинул чат: ")

    val inputTime = Integer.valueOf(readLine()) //Принимает целочисленный тип данных
    val message:String = agoToText(inputTime) //Сохранение в переменную значения, которое возвращает метод agoToText
    println(message)
}
fun agoToText(inputTime: Int):String = when (inputTime) {
    in 0..60 -> "был(а) только что" //0 - 60
    61, 21 * 60, 31 * 60, 41 * 60, 51 * 60 -> {"был(а) " + inputTime/60 + " минуту назад"} //1, 21, 31, 41, 51 - минуту
    in 2 * 60..4 * 60 -> {"был(а) " + inputTime/60 + " минуты назад"} //2, 3, 4 - минуты
    in 5 * 60..1 * 60 * 60 -> {"был(а) " + inputTime/60 + " минут назад"} //Остальное - минут
    1 * 60 * 60 + 1, 21 * 60 * 60 -> {"был(а) " + inputTime/60/60 + " час назад"} //1 и 21 - час
    in 2 * 60 * 60..4 * 60 * 60 -> {"был(а) " + inputTime/60/60 + " часа назад"} //2,3,4 - часа
    in 22 * 60 * 60..24 * 60 * 60 -> {"был(а) " + inputTime/60/60 + " часа назад"} //22,23,24 - часа
    in 5 * 60 * 60..20 * 60 * 60  -> {"был(а) " + inputTime/60/60 + " часов назад"} //5 - 20 часов
    in 24 * 60 * 60 + 1..48 * 60 * 60 -> "был(а) вчера"
    in 48 * 60 * 60 + 1..72 * 60 * 60 -> "был(а) позавчера"
    else -> "был(а) давно"
}

// 0 - 60 - только что
// 61 - 3060 - 1, 21, 31, 41, 51 минуту назад
// 120 - 240 - 2, 3, 4 минуты назад
// 300 - 3600 - минут назад
// 3601 - 75600 - 1 и 21 час назад
// 7200 - 14400 - 2,3,4 часа назад
// 79200 - 86400 - 22,23,24 часа назад
// 18000 - 72000 - 5-20 часов назад
// 86401 - 172800 - вчера
// 172801 - 259200 - позавчера
// 259201 - +∞ давно